src/Catalogs/ar_LLMПровайдеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_LLMПровайдеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_ТипПровайдера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_BaseURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_APIKeyИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_DefaultModel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПоддерживаетToolCalls</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Включён</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_MaxContext</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ar_Агенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Агенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_LLMПровайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_LLMПровайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_РежимАвтономии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_РежимАвтономии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Инструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИмяРоли1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_МаксШагов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_МаксДействий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_МаксСуммаДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_РасписаниеCron</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ТокенИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИспользоватьСессии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ar_ДоступныеTools</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Tool</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Включен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ar_ПереопределенияПромпта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ar_ПодключённыеSkills</Name>
					<Comment>M:N-связь агента с реестром ar_Skills (META-23). Содержимое подключённых и включённых skills инжектируется в STABLE-слой контекста (SKILL-02).</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Skill</Name>
							<Comment>Ссылка на элемент реестра ar_Skills (META-23).</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ar_Skills</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Включен</Name>
							<Comment>Позволяет временно отключить подключённый skill без удаления строки ТЧ.</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Порядок</Name>
							<Comment>Порядковый номер для детерминированной инжекции содержимого skills в STABLE-слой. Меньшее значение - раньше в конкатенации.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ar_Skills.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Skills</Name>
			<Comment>Реестр переиспользуемых markdown-skills для агентов. META-23.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Категория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Содержимое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ИсточникРасширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Обновлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ar_RuntimeКонтекст/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_RuntimeКонтекст (AOS Runtime - Контекст).
//
// Сборка «окна контекста» LLM перед каждым шагом ReAct-цикла (RT-06).
// Реализует трёхслойную структуру (Plan §6.1):
//   * STABLE      - системное сообщение role="system": workspace-промпт
//                   (ar_ОбщийСистемныйPrompt), инструкция агента,
//                   переопределения промпта, содержимое skills,
//                   инструкция-добавка от рутины, техническая мета-строка;
//   * SEMI-STABLE - memory index (включается в STABLE - задел на будущее);
//   * DYNAMIC     - накопленная история диалога (Состояние.Сообщения).
//
// Кроме сборки, модуль вызывает ar_LLMКомпакция.Применить - компакция
// выполняется здесь, перед передачей в ar_LLMДиспетчер.
//
// Модуль чистый: не пишет в ИБ (кроме журнала регистрации при ошибке
// разбора манифеста tool), не делает HTTP, не устанавливает привилегированный
// режим.
//
// Свойства модуля (выставлены в манифесте):
//   Server = true, Client = false, ServerCall = false,
//   Privileged = false, ReturnValuesReuse = DontUse.
//
// См. спеку: .docs/specs/RT-04.md, Plan §2.8, §2.4.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Строит «окно контекста» LLM для одного шага ReAct-цикла.
//
// Алгоритм (RT-04):
//   1. Получить MaxContext провайдера агента (0 → компакция отключена).
//   2. Собрать STABLE-слой - одно сообщение role="system":
//      workspace-промпт + инструкция агента + переопределения + техмета.
//   3. Получить определения tools (разобранные манифесты активных tools).
//   4. Скопировать DYNAMIC-слой (Состояние.Сообщения).
//   5. Итог = [системное] + [история].
//   6. Применить компакцию (если MaxContext > 0).
//   7. Вернуть окно контекста.
//
// Параметры:
//   Состояние    - Структура - контракт RT-06:
//                  Сообщения (Массив), RunId (Строка), ШаговВсего,
//                  ДействийВсего, ОжидаютApproval, Результат,
//                  ТокеновВход, ТокеновВыход.
//   ДанныеАгента - Структура - контракт RT-06:
//                  Ссылка, Наименование, ИмяРоли1С, LLMПровайдер, Модель,
//                  Температура, МаксШагов, МаксДействий, РежимАвтономии,
//                  Инструкция.
//
// Возвращаемое значение:
//   Структура - ОкноКонтекста:
//     messages         - Массив  - сообщения после компакции;
//                        [0].role = "system" (STABLE), далее история.
//     tool_definitions - Массив  - разобранные манифесты активных tools.
//     БылаКомпакция    - Булево  - признак применённой компакции.
//     ТипКомпакции     - Строка  - "none" | "soft" | "hard".
//     ОценкаТокенов    - Число   - оценка длины итогового окна (для аудита).
//
Функция ПостроитьКонтекст(Состояние, ДанныеАгента) Экспорт

	// 1. MaxContext провайдера (0 → компакция отключена).
	MaxContext = MaxContextПровайдера(ДанныеАгента);

	// 2. STABLE-слой - системное сообщение.
	СистемноеСообщение = ar_LLMКонтракт.НовоеСообщение(
		ar_LLMКонтракт.РольSystem(),
		СобратьСистемныйPrompt(Состояние, ДанныеАгента));

	// 3. Определения tools.
	ОпределенияTools = СобратьОпределенияTools(ДанныеАгента);

	// 4-5. Итоговый массив: [системное] + [история].
	ИтоговыеСообщения = Новый Массив;
	ИтоговыеСообщения.Добавить(СистемноеСообщение);
	ДобавитьИсторию(ИтоговыеСообщения, Состояние);

	// 6. Компакция (только при MaxContext > 0).
	ОкноКонтекста = НовоеОкноКонтекста();
	ОкноКонтекста.tool_definitions = ОпределенияTools;

	Если MaxContext > 0 Тогда
		РезультатКомпакции = ar_LLMКомпакция.Применить(
			ИтоговыеСообщения, MaxContext, ДанныеАгента.Модель);
		Если РезультатКомпакции.БылаКомпакция Тогда
			ИтоговыеСообщения = РезультатКомпакции.Сообщения;
			ОкноКонтекста.БылаКомпакция = Истина;
			ОкноКонтекста.ТипКомпакции = РезультатКомпакции.ТипКомпакции;
		КонецЕсли;
	КонецЕсли;

	ОкноКонтекста.messages = ИтоговыеСообщения;
	ОкноКонтекста.ОценкаТокенов = ar_Токены.ОценитьМассив(
		ИтоговыеСообщения, ДанныеАгента.Модель);

	Возврат ОкноКонтекста;

КонецФункции

// Читает MaxContext провайдера агента одним запросом.
// Возвращает 0, если провайдер не задан или MaxContext не определён -
// в этом случае компакция отключается.
//
// Параметры:
//   ДанныеАгента - Структура - контракт RT-06: поле LLMПровайдер.
//
// Возвращаемое значение:
//   Число - MaxContext провайдера (0 = компакция отключена).
//
Функция MaxContextПровайдера(ДанныеАгента) Экспорт

	Провайдер = Неопределено;
	Если ТипЗнч(ДанныеАгента) = Тип("Структура") Тогда
		ДанныеАгента.Свойство("LLMПровайдер", Провайдер);
	КонецЕсли;

	Если Провайдер = Неопределено
		ИЛИ ТипЗнч(Провайдер) <> Тип("СправочникСсылка.ar_LLMПровайдеры")
		ИЛИ Провайдер.Пустая() Тогда
		Возврат 0;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Провайдер", Провайдер);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Провайдеры.ar_MaxContext КАК MaxContext
		|ИЗ
		|	Справочник.ar_LLMПровайдеры КАК Провайдеры
		|ГДЕ
		|	Провайдеры.Ссылка = &Провайдер";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат 0;
	КонецЕсли;

	MaxContext = Выборка.MaxContext;
	Если ТипЗнч(MaxContext) <> Тип("Число") ИЛИ MaxContext < 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат MaxContext;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор выходной структуры с дефолтами.
//
Функция НовоеОкноКонтекста()

	Окно = Новый Структура;
	Окно.Вставить("messages", Новый Массив);
	Окно.Вставить("tool_definitions", Новый Массив);
	Окно.Вставить("БылаКомпакция", Ложь);
	Окно.Вставить("ТипКомпакции", "none");
	Окно.Вставить("ОценкаТокенов", 0);
	Возврат Окно;

КонецФункции



// Собирает текст системного сообщения (STABLE-слой).
// Порядок конкатенации: §1 workspace-промпт, §2 инструкция агента,
// §3 переопределения промпта, §3.5 подключённые skills,
// §3.6 инструкция-добавка от рутины (ROUT-04), §4 техническая мета-строка.
//
Функция СобратьСистемныйPrompt(Состояние, ДанныеАгента)

	Части = Новый Массив;

	// §1. Workspace-промпт (контекст компании).
	WorkspacePrompt = СокрЛП(ar_Константы.ОбщийСистемныйPrompt());
	Если Не ПустаяСтрока(WorkspacePrompt) Тогда
		Части.Добавить(WorkspacePrompt);
	КонецЕсли;

	// §2. Инструкция агента.
	Инструкция = "";
	Если ТипЗнч(ДанныеАгента) = Тип("Структура") Тогда
		ДанныеАгента.Свойство("Инструкция", Инструкция);
	КонецЕсли;
	Инструкция = СокрЛП(?(ТипЗнч(Инструкция) = Тип("Строка"), Инструкция, ""));
	Если Не ПустаяСтрока(Инструкция) Тогда
		Части.Добавить(Инструкция);
	КонецЕсли;

	// §3. Переопределения промпта (ТЧ ar_ПереопределенияПромпта).
	Для Каждого ТекстПереопределения Из СобратьПереопределенияПромпта(ДанныеАгента) Цикл
		Части.Добавить(ТекстПереопределения);
	КонецЦикла;

	// §3.5. Содержимое подключённых skills (ТЧ ar_ПодключённыеSkills, SKILL-02).
	Для Каждого БлокSkill Из СобратьСодержимоеSkills(ДанныеАгента) Цикл
		Части.Добавить(БлокSkill);
	КонецЦикла;

	// §3.6. Инструкция-добавка от рутины-триггера (ROUT-04).
	Добавка = ИнструкцияДобавкаРутины(Состояние);
	Если Не ПустаяСтрока(Добавка) Тогда
		Части.Добавить(Добавка);
	КонецЕсли;

	// §2.5. Memory Index — долгосрочная память агента (MEM-01) или пользователя
	// в режиме «без агента» (MEM-03). Загружается из ar_ПамятьАгента; при
	// отсутствии записей — не включается.
	БлокПамяти = ЗагрузитьБлокПамяти(Состояние, ДанныеАгента);
	Если Не ПустаяСтрока(БлокПамяти) Тогда
		Части.Добавить(БлокПамяти);
	КонецЕсли;

	// §4. Техническая мета-строка.
	Части.Добавить(ТехническаяМетаСтрока(Состояние, ДанныеАгента));

	Возврат СтрСоединить(Части, Символы.ПС + Символы.ПС);

КонецФункции

// Читает переопределения промпта из ТЧ ar_ПереопределенияПромпта агента.
// Каждая непустая пара Ключ/Значение возвращается строкой "[{Ключ}]\n{Значение}".
//
Функция СобратьПереопределенияПромпта(ДанныеАгента)

	Результат = Новый Массив;

	Агент = СсылкаАгента(ДанныеАгента);
	Если Агент = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Агент", Агент);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Переопределения.ar_Ключ КАК Ключ,
		|	Переопределения.ar_Значение КАК Значение
		|ИЗ
		|	Справочник.ar_Агенты.ar_ПереопределенияПромпта КАК Переопределения
		|ГДЕ
		|	Переопределения.Ссылка = &Агент
		|УПОРЯДОЧИТЬ ПО
		|	Переопределения.НомерСтроки";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключ = СокрЛП(Строка(Выборка.Ключ));
		Значение = СокрЛП(Строка(Выборка.Значение));
		Если ПустаяСтрока(Ключ) И ПустаяСтрока(Значение) Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить("[" + Ключ + "]" + Символы.ПС + Значение);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Читает содержимое подключённых skills из ТЧ ar_ПодключённыеSkills агента.
// Каждый включённый skill с непустым ar_Содержимое возвращается блоком
// "## Skill: <Имя>\n\n<Содержимое>". Порядок: ar_Порядок, НомерСтроки.
// Пустые contents пропускаются с предупреждением в журнал (SKILL-02).
//
Функция СобратьСодержимоеSkills(ДанныеАгента)

	Результат = Новый Массив;

	Агент = СсылкаАгента(ДанныеАгента);
	Если Агент = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Агент", Агент);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SkillsRef.ar_Имя КАК ИмяSkill,
		|	SkillsRef.ar_Содержимое КАК Содержимое
		|ИЗ
		|	Справочник.ar_Агенты.ar_ПодключённыеSkills КАК Skills
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ar_Skills КАК SkillsRef
		|		ПО Skills.ar_Skill = SkillsRef.Ссылка
		|ГДЕ
		|	Skills.Ссылка = &Агент
		|	И Skills.ar_Включен = ИСТИНА
		|	И НЕ SkillsRef.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	Skills.ar_Порядок,
		|	Skills.НомерСтроки";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИмяSkill = СокрЛП(Строка(Выборка.ИмяSkill));
		Содержимое = СокрЛП(Строка(Выборка.Содержимое));

		Если ПустаяСтрока(Содержимое) Тогда
			ЗаписатьПредупреждениеОПустомSkill(ИмяSkill);
			Продолжить;
		КонецЕсли;

		// Заголовок "## Skill: <Имя>" - структурный маркер для LLM, не локализуется
		// (аналогично [Ключ] в переопределениях промпта, см. спеку SKILL-02 D8).
		Блок = "## Skill: " + ИмяSkill + Символы.ПС + Символы.ПС + Содержимое;
		Результат.Добавить(Блок);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Формирует техническую мета-строку (§4 системного промпта).
//
Функция ТехническаяМетаСтрока(Состояние, ДанныеАгента)

	Шаблон = НСтр(
		"ru = 'Дата и время: %1. Агент: %2. Run ID: %3. Максимум шагов: %4. Максимум действий: %5.';
		|en = 'Date and time: %1. Agent: %2. Run ID: %3. Max steps: %4. Max actions: %5.'");

	ДатаВремя = Формат(ТекущаяДатаСеанса(), "ДФ=yyyy-MM-dd HH:mm:ss");

	Наименование = "";
	RunId = "";
	МаксШагов = 0;
	МаксДействий = 0;
	Если ТипЗнч(ДанныеАгента) = Тип("Структура") Тогда
		ДанныеАгента.Свойство("Наименование", Наименование);
		ДанныеАгента.Свойство("МаксШагов", МаксШагов);
		ДанныеАгента.Свойство("МаксДействий", МаксДействий);
	КонецЕсли;
	Если ТипЗнч(Состояние) = Тип("Структура") Тогда
		Состояние.Свойство("RunId", RunId);
	КонецЕсли;

	ЧислоШагов = ?(ТипЗнч(МаксШагов) = Тип("Число"), МаксШагов, 0);
	ЧислоДействий = ?(ТипЗнч(МаксДействий) = Тип("Число"), МаксДействий, 0);
	ПредставлениеШагов = Формат(ЧислоШагов, "ЧГ=; ЧН=0");
	ПредставлениеДействий = Формат(ЧислоДействий, "ЧГ=; ЧН=0");

	Возврат СтрШаблон(Шаблон,
		ДатаВремя,
		Строка(Наименование),
		Строка(RunId),
		ПредставлениеШагов,
		ПредставлениеДействий);

КонецФункции

// Возвращает инструкцию-добавку от рутины-триггера для §3.6 STABLE-слоя (ROUT-04).
//
// Данные уже находятся в Состояние (заполнены в ar_RuntimeЦикл.ВыполнитьАгентаВнутр
// из КонтекстТриггера.ИнструкцияДобавка). Запросов к ИБ не делается -
// модуль остаётся «чистым» (без привилегий, RT-04).
//
// Параметры:
//  Состояние - Структура - контракт RT-06, содержит поле ИнструкцияДобавка (Строка).
//
// Возвращаемое значение:
//  Строка - непустой текст добавки (после СокрЛП) или "".
//
Функция ИнструкцияДобавкаРутины(Состояние)

	Если ТипЗнч(Состояние) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;

	Добавка = "";
	Состояние.Свойство("ИнструкцияДобавка", Добавка);
	Возврат СокрЛП(?(ТипЗнч(Добавка) = Тип("Строка"), Добавка, ""));

КонецФункции

// Собирает определения tools: активные tools агента с валидным манифестом.
// Запрос: ТЧ ar_ДоступныеTools (ar_Включен) JOIN ar_Tools (ar_Включён).
// Невалидный манифест конкретного tool пропускается с записью в журнал.
//
// UNIV-03: дополнительно фильтрует по ar_Доступен — вычисляемому кэшу
// ar_ToolDispatcher.ПроверитьДоступностьTool (пересчитывается при регистрации
// tools и при обновлении версии расширения), а не по ar_Включён (воля
// администратора). Разница: ar_Включён = Ложь — администратор осознанно
// отключил рабочий tool; ar_Доступен = Ложь — tool физически не может
// отработать на этой базе (нет требуемых объектов метаданных). Оба условия
// нужны совместно, чтобы LLM не тратила контекст/вызовы на заведомо
// нерабочие инструменты (например create_invoice_draft на конфигурации без
// СчетНаОплатуПокупателю).
//
// Параметры:
//  ДанныеАгента - Структура - контракт RT-06, содержит поле Ссылка
//                 (СправочникСсылка.ar_Агенты).
//
// Возвращаемое значение:
//  Массив - разобранные JSON-манифесты активных и доступных tools агента,
//           в порядке ДоступныеTools.НомерСтроки.
//
Функция СобратьОпределенияTools(ДанныеАгента)

	Результат = Новый Массив;

	Агент = СсылкаАгента(ДанныеАгента);

	// ВРЕМЕННО (диагностика потери tool_definitions): фиксируем, доходит ли
	// ссылка агента до сборки контекста и сколько строк вернул запрос ТЧ.
	СсылкаДА = Неопределено;
	Если ТипЗнч(ДанныеАгента) = Тип("Структура") Тогда
		ДанныеАгента.Свойство("Ссылка", СсылкаДА);
	КонецЕсли;
	ar_СлужебныйЛог.Записать(
		"ar_RuntimeКонтекст.СобратьОпределенияTools",
		"debug_agent_ref",
		СтрШаблон("ТипСсылкаДА=%1; СсылкаДА=%2; АгентИтог=%3",
			?(СсылкаДА = Неопределено, "Неопределено", Строка(ТипЗнч(СсылкаДА))),
			?(СсылкаДА = Неопределено, "-", Строка(СсылкаДА)),
			?(Агент = Неопределено, "Неопределено", Строка(Агент))),
		"Информация");

	Если Агент = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Агент", Агент);
	Запрос.Текст =
		// Реквизит ТЧ ar_Tool - СТРОКА с именем tool (ar_Имя), а не ссылка на
		// справочник (см. Catalogs/ar_Агенты.xml: Строка(150), и форму карточки
		// агента, которая пишет туда ИмяTool). Соединение идёт по имени;
		// сравнение с Tools.Ссылка давало 0 строк - агент оставался без
		// инструментов, и в LLM уходил только ask_user.
		"ВЫБРАТЬ
		|	Tools.ar_Имя КАК ИмяTool,
		|	Tools.ar_JSONManifest КАК Манифест
		|ИЗ
		|	Справочник.ar_Агенты.ar_ДоступныеTools КАК ДоступныеTools
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ar_Tools КАК Tools
		|		ПО ДоступныеTools.ar_Tool = Tools.ar_Имя
		|ГДЕ
		|	ДоступныеTools.Ссылка = &Агент
		|	И ДоступныеTools.ar_Включен = ИСТИНА
		|	И Tools.ar_Включён = ИСТИНА
		|	И Tools.ar_Доступен = ИСТИНА
		|	И НЕ Tools.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	ДоступныеTools.НомерСтроки";

	Выборка = Запрос.Выполнить().Выбрать();

	// ВРЕМЕННО (диагностика): счётчики для debug_tools_collected ниже.
	ДиагИмена = Новый Массив;
	ДиагСтрок = 0;

	Пока Выборка.Следующий() Цикл

		ДиагСтрок = ДиагСтрок + 1;
		ИмяTool = СокрЛП(Строка(Выборка.ИмяTool));
		Манифест = Выборка.Манифест;
		МанифестСтрока = ?(ТипЗнч(Манифест) = Тип("Строка"), Манифест, Строка(Манифест));

		РазобранныйМанифест = ar_JSON.ИзJSON(МанифестСтрока);
		Если РазобранныйМанифест = Неопределено Тогда
			ЗаписатьПредупреждениеОМанифесте(ИмяTool);
			Продолжить;
		КонецЕсли;

		Результат.Добавить(РазобранныйМанифест);
		ДиагИмена.Добавить(ИмяTool);

	КонецЦикла;

	// ВРЕМЕННО (диагностика потери tool_definitions): сколько строк вернул
	// запрос ТЧ и какие имена реально попали в набор для LLM.
	ar_СлужебныйЛог.Записать(
		"ar_RuntimeКонтекст.СобратьОпределенияTools",
		"debug_tools_collected",
		СтрШаблон("Агент=%1; СтрокВыборки=%2; ВНабор=%3; Имена=%4",
			Строка(Агент), ДиагСтрок, Результат.Количество(),
			?(ДиагИмена.Количество() = 0, "-", СтрСоединить(ДиагИмена, ", "))),
		"Информация");


	Возврат Результат;

КонецФункции

// Копирует историю диалога (DYNAMIC-слой) в итоговый массив.
//
Процедура ДобавитьИсторию(ИтоговыеСообщения, Состояние)

	Если ТипЗнч(Состояние) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	История = Неопределено;
	Состояние.Свойство("Сообщения", История);
	Если ТипЗнч(История) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Сообщение Из История Цикл
		ИтоговыеСообщения.Добавить(Сообщение);
	КонецЦикла;

КонецПроцедуры

// Безопасно извлекает ссылку агента из ДанныеАгента.
//
Функция СсылкаАгента(ДанныеАгента)

	Если ТипЗнч(ДанныеАгента) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Ссылка = Неопределено;
	ДанныеАгента.Свойство("Ссылка", Ссылка);
	Если ТипЗнч(Ссылка) <> Тип("СправочникСсылка.ar_Агенты") ИЛИ Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Ссылка;

КонецФункции

// Пишет предупреждение в журнал регистрации при ошибке разбора манифеста tool.
//
Процедура ЗаписатьПредупреждениеОМанифесте(ИмяTool)

	ПредставлениеИмени = ?(ПустаяСтрока(ИмяTool), "<empty>", ИмяTool);
	ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'Невалидный JSON-манифест инструмента ""%1"" - инструмент пропущен при сборке контекста';
			|en = 'Invalid JSON manifest of tool ""%1"" - tool skipped during context build'"),
		ПредставлениеИмени);

	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'ar_RuntimeКонтекст.СборкаTools'; en = 'ar_RuntimeКонтекст.СборкаTools'"),
		УровеньЖурналаРегистрации.Предупреждение,
		,
		,
		ТекстПредупреждения);

КонецПроцедуры

// Загружает блок памяти владельца (агента либо пользователя ИБ в режиме «без
// агента», MEM-03) для вставки в STABLE-слой (MEM-01, §2.5). Делегирует в
// ar_Память.ЗагрузитьИндекс. При ошибке возвращает "".
//
// Параметры:
//  Состояние    - Структура - контракт RT-06, содержит поле ПользовательUUID
//                 (MEM-03: заполняется ar_RuntimeЦикл.КонтекстЗапуска из
//                 КонтекстТриггера.ПользовательUUID, см. ar_RuntimeЦикл ~1592).
//  ДанныеАгента - Структура - контракт RT-06, содержит поле Ссылка.
//
// Возвращаемое значение:
//  Строка - блок "## Memory Index\n..." или "", если нет записей или ошибка.
//
Функция ЗагрузитьБлокПамяти(Состояние, ДанныеАгента)

	Агент = СсылкаАгента(ДанныеАгента);

	ПользовательUUID = "";
	Если ТипЗнч(Состояние) = Тип("Структура") Тогда
		Состояние.Свойство("ПользовательUUID", ПользовательUUID);
	КонецЕсли;
	ПользовательUUID = СокрЛП(?(ТипЗнч(ПользовательUUID) = Тип("Строка"), ПользовательUUID, ""));

	// Ни агента, ни пользователя - нечего грузить (граничный случай MEM-03).
	Если Агент = Неопределено И ПустаяСтрока(ПользовательUUID) Тогда
		Возврат "";
	КонецЕсли;

	Попытка
		Возврат ar_Память.ЗагрузитьИндекс(Агент, ПользовательUUID);
	Исключение
		// Блок памяти — вспомогательная секция; ошибка не должна прерывать сборку
		// контекста. Фиксируем ошибку в журнале и продолжаем без блока памяти.
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_RuntimeКонтекст.БлокПамяти'; en = 'ar_RuntimeКонтекст.MemoryBlock'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат "";
	КонецПопытки;

КонецФункции

// Пишет предупреждение в журнал регистрации при пустом содержимом skill (SKILL-02).
//
Процедура ЗаписатьПредупреждениеОПустомSkill(ИмяSkill)

	ПредставлениеИмени = ?(ПустаяСтрока(ИмяSkill), "<empty>", ИмяSkill);
	ТекстПредупреждения = СтрШаблон(
		НСтр("ru = 'Пустое содержимое skill ""%1"" - skill пропущен при сборке контекста';
			|en = 'Empty content of skill ""%1"" - skill skipped during context build'"),
		ПредставлениеИмени);

	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'ar_RuntimeКонтекст.СборкаSkills'; en = 'ar_RuntimeКонтекст.СборкаSkills'"),
		УровеньЖурналаРегистрации.Предупреждение,
		,
		,
		ТекстПредупреждения);

КонецПроцедуры

#КонецОбласти
